# FbxLightSpotFieldAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightSpotFieldAngle Property
ParameterTypeId Class See Also
---
"Spot Field Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightSpotFieldAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightSpotFieldAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightSpotFieldAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace